package exPackage.game_project.game;

import java.util.Scanner;

public class Guess {
	static int r, u;
	
	// 1.랜덤숫자 설정
	public static void setRandom() {
		r = (int)(Math.random()*10)+1;
	}

	// 2.숫자 맞추기
	public static void getGuess(Scanner sc) {
		System.out.print("숫자입력: ");
		u = sc.nextInt();
		
		while(u != r) {
			System.out.println("・┈┈┈┈┈┈┈┈┈┈┈┈┈┈┈┈┈┈┈┈┈┈┈┈┈┈┈┈┈┈┈┈・");
			System.out.print("아닙니다. 다시 맞혀보세요~. 다시 입력 : ");
			u = sc.nextInt();
		}
		System.out.println("・┈┈┈┈┈┈┈┈┈┈┈┈┈┈┈┈┈┈┈┈┈┈┈┈┈┈┈┈┈┈┈┈・");
		System.out.printf("드디어 맞혔습니다! 나의 숫자는 %d입니다!\n",r);
		System.out.println("・𝜗𝜚・┈・┈・・┈・┈・┈・┈・┈・┈・┈・┈・┈・・┈・┈・𝜗𝜚・");
		
	}
	
	// 3.게임 메인
	public static void play(Scanner sc) {
		System.out.println("・𝜗𝜚・┈・┈・・┈・┈・┈・┈・┈・┈・┈・┈・┈・・┈・┈・𝜗𝜚・");
		System.out.println("     ★ꔫ 숫자 알아맞히기 게임 ꔫ★");
		System.out.println("・𝜗𝜚┈┈┈┈┈┈┈┈┈┈┈┈┈┈┈┈┈┈┈┈┈┈┈┈┈┈┈┈┈𝜗𝜚・");
		System.out.println("ꔫ 어떤 숫자일까요? 알아 맞혀보세요(1~10)");
		setRandom();
		System.out.println("・┈┈┈┈┈┈┈┈┈┈┈┈┈┈┈┈┈┈┈┈┈┈┈┈┈┈┈┈┈┈┈┈・");
		getGuess(sc);
	}
}